### Importing libs

In [5]:
from sqlalchemy import create_engine
from IPython.display import display
import pandas as pd

In [2]:
%load_ext sql

### Connecting to a PostgreSQL database

In [3]:
engine = create_engine('postgresql://ns:ns_pass@localhost/moodle')
%sql postgresql://ns:ns_pass@localhost/moodle

'Connected: ns@moodle'

### Number of tables in moodle database

In [4]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(448,)]

### Number of records in each of the tables given in the MIT section

In [57]:
mit = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules' , 'mdl_course_modules', 'mdl_course_modules_completion',
       'mdl_grade_items', 'mdl_grade_grades', 'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
       'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']

# fetches and returns number of records of a given table in moodle database
def table_count(table):
    count = %sql select count(*) as {table}_count from {table}
    return count

for table in mit:
    display(table_count(table))

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(417554,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(4359,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(1052,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(15,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(26,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(290,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(4483,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(113,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(3643,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(16,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(486,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(7108,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(46,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(34,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(23,)]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(131,)]

### Number of quiz submissions by hour of day

In [29]:
%%sql

SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://ns:***@localhost/moodle
24 rows affected.

[(0.0, 26),
 (1.0, 23),
 (2.0, 30),
 (3.0, 29),
 (4.0, 7),
 (5.0, 14),
 (6.0, 10),
 (7.0, 18),
 (8.0, 17),
 (9.0, 34),
 (10.0, 46),
 (11.0, 69),
 (12.0, 95),
 (13.0, 88),
 (14.0, 104),
 (15.0, 90),
 (16.0, 80),
 (17.0, 68),
 (18.0, 68),
 (19.0, 70),
 (20.0, 57),
 (21.0, 55),
 (22.0, 46),
 (23.0, 53)]

### Monthly usage time of learners who have confirmed and are not deleted

In [35]:
%%sql

SELECT id, lastaccess - firstaccess AS usagetime,
EXTRACT(MONTH FROM to_timestamp (firstaccess)) AS Month
FROM mdl_user WHERE confirmed = 1 AND deleted = 0 LIMIT 10;

 * postgresql://ns:***@localhost/moodle
10 rows affected.

[(1, 0, 1.0),
 (20, 13189566, 2.0),
 (15, 13903766, 2.0),
 (36, 9586676, 2.0),
 (44, 10458089, 2.0),
 (8, 1830649, 1.0),
 (13, 0, 1.0),
 (98, 12944059, 2.0),
 (28, 0, 1.0),
 (12, 0, 1.0)]

### Count of log events per user

In [59]:
actions = ['loggedin', 'viewed', 'started', 'submitted', 'uploaded', 'updated', 
 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

# fetch and return count of log events of a give action per user
def event_count(action):
    count = %sql SELECT userid, COUNT(action) AS {action}_count FROM mdl_logstore_standard_log WHERE action='{action}' GROUP BY userid limit 5
    return count

for action in actions:
    display(event_count(action))

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

 * postgresql://ns:***@localhost/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

 * postgresql://ns:***@localhost/moodle
0 rows affected.

[]

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(2, 5)]

### Python class to pull Overall grade of learners and Number of forum posts

In [60]:
class DBHandler():
    def __init__(self):
        pass
    
    def open_local_db(self,**kwargs):
        #extract args, if they are not provided assign a default value
        user = kwargs.get('user','ns')
        password = kwargs.get('password', 'ns_pass')
        db = kwargs.get('db','moodle')
        
        # try to make a connection to PostgreSQL
        # show error message if failed to make a connection
        try:
            params = dict(user=user,
                          password=password,
                          host = "127.0.0.1",
                          #port = "5432",
                          database = db)
            proot = 'postgresql://{user}:{password}@{host}/{database}'.format(**params)
            engine = create_engine(proot)
        except (Exception, psycopg2.Error) as error :
            logger.error(f"Error while connecting to PostgreSQL {error}")
            
        return engine
    
    # fetch and return overall grade of learners
    def num_forum_posts(self):
        count = %sql select count(*) from mdl_forum_posts
        return count
    
    # fetch and return number of forum posts
    def overall_grade(self):
        overall = %sql select userid, round(SUM(finalgrade)/count(*), 2) as overall_grade from mdl_grade_grades Where finalgrade is not null group by userid
        return overall

In [61]:
db = DBHandler()
db.open_local_db()

Engine(postgresql://ns:***@127.0.0.1/moodle)

In [62]:
db.num_forum_posts()

 * postgresql://ns:***@localhost/moodle
1 rows affected.

[(131,)]

In [ ]:
db.overall_grade()

In [7]:
log_df = pd.read_sql("select * from mdl_logstore_standard_log", engine)

In [8]:
log_df.shape

(417554, 21)

In [ ]:
log_df.info()

In [78]:
log_in_out = log_df[(log_df.action == "loggedin") | (log_df.action == "loggedout")]

In [121]:
user_id =  log_df.userid.unique()

d_times = {}
l = 0
for user in user_id:
    l += 1
    
    log_user = log_in_out[log_in_out.userid == user].sort_values('timecreated')
    
    d_time = 0 
    isLoggedIn = 0
    loggedIn_timecreated = 0
    for i, row in log_user.iterrows():
        if(row.action == "loggedin"): 
            isLoggedIn = 1
            loggedIn_timecreated = row.timecreated
            
        if((row.action == "loggedout") & (isLoggedIn == 1)):
            d_time += row.timecreated - loggedIn_timecreated
            isLoggedIn = 0
            
    d_times[user] = d_time

In [ ]:
d_times